Функция ЭтоКопияРабочейБазы(ЗаголовокПриложения) Экспорт
	
	ЗаголовокКопия = СтрНайти(ВРег(ЗаголовокПриложения), "КОПИЯ") <> 0;
         
    ВнешниеРесурсыЗаблокированы = Ложь;
	
	Попытка	
		Выполнить("ВнешниеРесурсыЗаблокированы = РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();");
	Исключение
	КонецПопытки;
			
	ЭтоКопияРабочейБазы = (ЗаголовокКопия Или ВнешниеРесурсыЗаблокированы) И ПравоДоступа("Просмотр", Метаданные.Обработки.FAST8Дневник_ДневникКопииБазы);
	
	Если ЭтоКопияРабочейБазы = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		СохраненнаяДатаПервогоЗапуска = ХранилищеОбщихНастроек.Загрузить("ДатаПервогоЗапуска", "FAST8ДневникКопииБазы",, "FAST8");
		Если СохраненнаяДатаПервогоЗапуска <> Неопределено Тогда
			ХранилищеОбщихНастроек.Удалить("ДатаПервогоЗапуска", "FAST8ДневникКопииБазы", "FAST8");
		КонецЕсли;
	Иначе
		// Отметим авторизацию в базе
		ДобавитьСобытие(Пользователи.ТекущийПользователь(), "Вошел в базу");
	КонецЕсли;
	
	Возврат ЭтоКопияРабочейБазы;
	
КонецФункции // ЭтоКопияРабочейБазы()

Процедура ДобавитьСобытие(Пользователь, Событие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСобытий = ХранилищеОбщихНастроек.Загрузить("События", "FAST8ДневникКопииБазы",, "FAST8");
    Если ТаблицаСобытий = Неопределено Тогда
		ТаблицаСобытий = Новый ТаблицаЗначений;
		ТаблицаСобытий.Колонки.Добавить("Дата",			Новый ОписаниеТипов("Дата"));
		ТаблицаСобытий.Колонки.Добавить("Пользователь",	Новый ОписаниеТипов("Строка"));
		ТаблицаСобытий.Колонки.Добавить("Событие",		Новый ОписаниеТипов("Строка"));
		
		// Вероятно, копию только что распаковали. Обнулим нумераторы в кластере 1С.
		ОбновитьНумерациюОбъектов();
	КонецЕсли;
	
	НоваяСтрока = ТаблицаСобытий.Вставить(0);
	НоваяСтрока.Дата			= ТекущаяДата();
	НоваяСтрока.Пользователь	= Пользователь;
	НоваяСтрока.Событие			= Событие;
	
	ХранилищеОбщихНастроек.Сохранить("События", "FAST8ДневникКопииБазы", ТаблицаСобытий,, "FAST8");
	
КонецПроцедуры // ДобавитьСобытие()